[
  {
    "name": "Eagle Lake Fisherman's Trail",
    "location": "Central Cascades",
    "rating": "4.0",
    "distance": "5.0",
    "elevation": "712",
    "description": "Historically, the most frequent approach to Eagle Lake has been via a scramble from Barclay Lake that is not suitable for most hikers. One story holds that Harvey Manning -- angry that logging in the lower Eagle Creek basin made road access to Eagle Lake via the Fisherman's route too easy -- intentionally omitted directions to this trailhead in his guidebook. The roadside parking area is marked with a “National Forest Wilderness” sign that bears a map of the region. The sign erroneously indicates “Barclay Lake #1055,” but knowledgeable hikers have indicated the location of the trailhead and the trail route with black marker. If you see this wrong sign, then you are in the right place!",
    "url": "http://www.wta.org/go-hiking/hikes/eagle-lake-fishermans-trail"
  },
  {
   "name": "Little Wenatchee Gorge",
   "location": "Central Cascades",
   "rating": "3.2",
   "distance": "3.0",
   "elevation": "250",
   "description": "Perhaps the best kept secret among the scores of trails within the Lake Wenatchee region, this one follows along the Little Wenatchee River at a dramatic gorge. A wonderful destination for hikers of all ages and abilities, the river puts on quite a show as it tumbles and froths over rapids and beneath ledges. Amble or while away the afternoon, or combine this hike with one of the other nearby short but sweet trails. The trail takes off south from the quiet campground and then immediately swings west. The spur that continues south follows Elevenmile Creek for a short distance to the Little Wenatchee River. It's not a bad diversion if you miss the turn. The main trail, however, continues across a bench of hemlock and huckleberry, shortly meeting up with the river at an inviting spot that encourages napping and picnicking. Directly across from the pristine waterway, Theseus Creek tumbles into it by a small campsite.",
   "url": "http://www.wta.org/go-hiking/hikes/little-wenatchee-river"
 },
 {
   "name": "Blanca Lake",
   "location": "Central Cascades",
   "rating": "4.4",
   "distance": "7.5",
   "elevation": "3300",
   "description": "Visit one of the most striking lakes in the Henry M. Jackson wilderness. The vibrant blue of the glacier-fed lake provides the perfect rest stop for hikers who have braved the thirty-odd, steep switchbacks that lead to the lake. If you can tear your eyes away from the trail, the view will take your breath away. Across the valley is the foot of Columbia Peak, and ss you round the last point, beautiful Blanca Lake opens up in all her glory. The lake is framed to the north by the peaks of Monte Cristo, Columbia, and Keyes. More than a few hikers have been known to gasp aloud when they round the corner and see the robin-egg blue waters.",
   "url": "http://www.wta.org/go-hiking/hikes/blanca-lake"
 },
 {
   "name": "Scorpion Mountain",
   "location": "Central Cascades",
   "rating": "NA",
   "distance": "8.0",
   "elevation": "2500",
   "description": "Scorpion Mountain offers a 360-degree view of the Central Cascades, and the huckleberries and blueberries make this a much underrated fall hike. The trail seems like a gentle climb up to the rounded top of Scorpion Mountain where there is room for lots of hikers, but, in the fall, it is often not crowded. Find a place to sit and eat lunch, and then turn around and enjoy the view on the other side.",
   "url": "http://www.wta.org/go-hiking/hikes/scorpion-mountain"
 },
 {
   "name": "Mount Persis",
   "location": "Central Cascades",
   "rating": "3.8",
   "distance": "4.0",
   "elevation": "2658",
   "description": "e prepared: this is not an easy hike. More a bootpath than a real trail, the route occasionally disappears in the undergrowth. The trail is also very steep in places, requiring a little help from nearby trees to make your way up. But the views are incredible; just don’t let the short mileage fool you, and plan on spending a few extra hours tackling this one. Once you reach the summit of Persis, soak up the expansive views. Neighboring Index is massive. Pick out Baring, Mt. Baker, Gunn Peak, and Mt. Rainier. The exposed granite of the Index Town Wall is easy to spot above the miniature town of Index, and Heybrook Ridge sits just under Mt. Baring. The 360-degree views offer plenty to see before starting the steep slog back down the mountain.",
   "url": "http://www.wta.org/go-hiking/hikes/mount-persis"
 },
 {
   "name": "Bridal Veil Falls",
   "location": "Central Cascades",
   "rating": "4.0",
   "distance": "4.0",
   "elevation": "1000",
   "description": "beautiful waterfall flows out of Lake Serene and cascades below the rugged east wall of Mount Index at the end ofa trail on the west side of Bridal Veil Creek. Take time to see and enjoy a stunning view of Bridal Veil Falls and climb flights of steps paralleling the falls. Children will be fascinated as they stand directly beside the water and look up a 100-foot rock face to see the streams of water that make up the bridal veil pouring beside them. An old nearby mine, the Honeymoon Mine, brought the original nineteenth-century travelers to the Lake Serene area.",
   "url": "http://www.wta.org/go-hiking/hikes/bridal-veil-falls"
 },
  {
    "name": "Windy Pass - Mount Catherine Snowshoe",
    "location": "Snoqualmie Pass",
    "rating": "3.0",
    "distance": "9.0",
    "elevation": "2300",
    "description": "A connector trail on Tiger Mountain. Access to or from West Tiger 3, Nook Trail, and Section Line Trail.",
    "url": "http://www.wta.org/go-hiking/hikes/windy-pass-mount-catherine-snowshoe"
  },
  {
    "name": "Joe Lake",
    "location": "Snoqualmie Pass",
    "rating": "4.1",
    "distance": "16.0",
    "elevation": "2235",
    "description": "This hike has a little bit of everything.To reach Little Joe Lake, hike Gold Creek Trail with gradual ups and downs to the Alaska Lake turnoff at about 5 miles. The main trail goes left and uphill to Alaska Lake. Take the other way. The Joe Lake trail starts here and goes straight ahead into the open meadows of slide alder and vine maple. This is where the work begins as the trail is no longer maintained past this point. Follow this rough trail around Alaska Mountain paying careful attention to where the main trail is (survey tape in trees marks the way). You will have to duck, crawl, and plow your way through this tangle of brush and the occasional downed log. Watch your step as there are lots of rocks in the trail that will twist an ankle. It's a pretty tedious trek through here so slow down and take your time. After about two miles, you will encounter a beautiful waterfall on your left. Once you cross the water you'll be on the right side the waterfall and the trail is no nonsense at this point. It goes straight up. You will not need hiking poles and coming back down almost guarantees removal of your pack and sliding it down in front of you with a rope. Once you have made it to the top, a plethora of campsites await you and if you are there in midsummer, squadrons of mosquitoes. Aside from the lake and meadows surrounding the lake, there are also several small ponds surrounding the lake. -Side trip 1, at the Alaska Lake trail, there is an abandoned gold mine about 500' above the valley bottom. Look for it to the right of the Alaska Lake Trail. You can only see it from the bottom of the hill. Take a good look at where it is and then look for a faint trail that leads that direction off the Alaska Lake Trail. The mine has about 6 of water in it during the summer and can be explored without flashlights. -Side trip 2 once at Joe Lake, the crest trail is a few hundred feet above the lake, the short route up is at the opposite end of the lake through the trees, but the no nonsense route up is right up the steep meadow or chute at the base of Huckleberry mountain. To the North of the lake on the PCT, there are numerous meadows and ponds to explore. Views are pretty good too.",
    "url": "http://www.wta.org/go-hiking/hikes/little-joe-lake",
  },
  {
    "name": "Lake Laura Backdoor",
    "location": "Snoqualmie Pass",
    "rating": "3.0",
    "distance": "3.0",
    "elevation": "1000",
    "description": "A short, beautiful, but very steep trail to Lake Laura and Lake Lillian. Gets you there in a quarter of the time, but breathing just as hard. The trail itself starts out in heavy brush, but the thread is obvious. It crosses a minor creek, and starts the climb.",
    "url": "http://www.wta.org/go-hiking/hikes/lake-laura-backdoor",
  },
  {
    "name": "Gold Creek-Alaska Lake",
    "location": "Snoqualmie Pass",
    "rating": "2.1",
    "distance": "11.0",
    "elevation": "1600",
    "description": "Early in the season, head here. This trail is haphazardly maintained and routefinding on its upper stretches can (and does) prove difficult. But for good routefinders and those who don't mind an occasional deadfall, it's a good early-season route to the high country of Alaska Lake. Even hikers who opt not to push on to Alaska Lake will enjoy the valley hike as it explores the creek basin and its multitude of beaver ponds and flower-filled clearings. The route follows the road as it heads north, deeper into the Gold Creek valley. Land on both sides of this road is privately owned, so don't wander off it for the first 0.5 mile. Past the end of the maintained road you'll find yourself on an old, abandoned miners track. This fading roadway peters out in another 0.25 mile, leaving you on a wide single-track trail",
    "url": "http://www.wta.org/go-hiking/hikes/alaska-lake",
  },
  {
    "name": "Franklin Falls",
    "location": "Snoqualmie Pass",
    "rating": "4.0",
    "distance": "2.0",
    "elevation": "400",
    "description": "Hiking with kids, new to hiking, or just looking for an easy day hike with a spectacular endpoint? Look no further than Franklin Falls! At just 2 miles roundtrip with 400 feet in elevation gain it is the perfect destination for any hiker looking for something easy and beautiful.",
    "url": "http://www.wta.org/go-hiking/hikes/franklin-falls",
  },
  {
    "name": "Lodge Lake",
    "location": "Snoqualmie Pass",
    "rating": "4.0",
    "distance": "3.0",
    "elevation": "500",
    "description": "The trail climbs gradually through scrubby forest for 0.5 mile as it makes its way from the freeway corridor. Abruptly, the path erupts out of the trees onto the smooth grassy slopes of the ski runs.",
    "url": "http://www.wta.org/go-hiking/hikes/lodge-lake",
  },
  {
    "name": "Humpback Mountain",
    "location": "Snoqualmie Pass",
    "rating": "3.5",
    "distance": "4.0",
    "elevation": "2500",
    "description": "This secluded hike off I-90 follows the NW ridge through small and then large trees to the top of Humpback mountain. The summit provides great views in all directions. This is a great snowshoeing trip in the winter. ",
    "url": "http://www.wta.org/go-hiking/hikes/humpback-mountain",
  },
  {
    "name": "Annette Lake",
    "location": "Snoqualmie Pass",
    "rating": "3.5",
    "distance": "7.5",
    "elevation": "1400",
    "description": "Waterfalls, wildflowers, sheltering forests, mountain views and an alpine lake are offered on this well-maintained trail. At the lake, enjoy the sights and relax for a while. If you backpacked in, stay at the campsites for a sunrise and sunset on the lake.",
    "url": "http://www.wta.org/go-hiking/hikes/annette-lake",
  },
  {
    "name": "Talapus and Olallie Lakes",
    "location": "Snoqualmie Pass",
    "rating": "3.2",
    "distance": "6.2",
    "elevation": "1220",
    "description": "With a moderate grade on a wide trail, the hike to Talapus Lake is the perfect introduction to the outdoors for hikers and beginning backpackers. Upon arrival at Talapus, break out lunch or pitch camp. Either way, you can cool off in the large lake. If you feel like pressing on, Ollalie Lake is just about a mile and a half up trail, where open campsites offer lakeside havens with calm waters and views of a beautiful lake basin.",
    "url": "http://www.wta.org/go-hiking/hikes/talapus-lake",
  },
  {
    "name": "Mount Margaret",
    "location": "Snoqualmie Pass",
    "rating": "4.0",
    "distance": "6.0",
    "elevation": "1500",
    "description": "N/A",
    "url": "http://www.wta.org/go-hiking/hikes/mount-margaret",
  },

  {
  "name": "Greenwater and Echo Lakes",
  "location": "Mount Rainier Area",
  "rating": "3.0",
  "distance": "14.0",
  "elevation": "1900",
  "description": "Visit a trail where rushing rivers, placid lakes, and wild forests line the trail. The Greenwater River is your constant companion on this hike, winding with you through cool, old-growth forest along this quiet path to two basin lakes. As you walk, watch for the deer and elk that make this area their home. This trail is also used by equestrians, Horse fords for crossing the river are clearly marked with charming wood signs. Be sure to share the trail accordingly!",
  "url": "http://www.wta.org/go-hiking/hikes/greenwater-lakes",
},

{
  "title": "Tipsoo Lake-Naches Peak Loop",
  "location": "Mount Rainier Area",
  "rating": "4.1",
  "distance":"3.2",
  "elevation":"600",
  "description": "This popular hike provides a range of alpine experiences in a short loop. Walk along a hillside above a small valley, pause at a viewpoint overlooking a lake, and stroll through grassy meadows with stunning views of Mount Rainier. In season enjoy an abundance of wildflowers or perhaps a handful of huckleberries. The hike follows the Pacific Crest Trail on the northern flank of Naches Peak and the Naches Peak Trail on the southern flank. The loop is best done clockwise for outstanding views of Mount Rainier.",
  "url": "http://www.wta.org/go-hiking/hikes/naches-peak-loop",
},

{
  "title": "Shriner Peak",
  "location": "Mount Rainier Area",
  "rating": "3.0",
  "distance": "8.5",
  "elevation": "3434",
  "description": "The under-appreciated Shriner Peak is one of the loneliest trails at Mount Rainier. It's long, steep, and exposed, making it nearly intolerable in the stale summer heat. But enter fall, when the change of season ushers in majestic color and cooler temps, it's the ideal time to hit this high-alpine trail before the snow starts falling again. From the get-go, the Shriner Peak Trail steadily ascends 3,424 feet in 4.25 miles. Bring lots of water--you'll need it , and there aren't many sources along the way. The trail runs parallel to Panther Creek through shade Douglas-fir, cedar, and hemlock for 0.75 miles before entering an old burn area. Traverse this shadeless stretch for another mile to a steep series of switchbacks to the top of a ridge under Shriner Peak. ",
  "url": "http://www.wta.org/go-hiking/hikes/shriner-peak",
},

{
  "title": "Ohanapecosh Hot Springs",
  "location": "Mount Rainier Area",
  "rating": "4.0",
  "distance": "1.0",
  "elevation": "50",
  "description": "Early tourists flocked to Ohanapecosh not because it was so spectacularly pretty, but because of the water. More specifically, because of the hot water burbling out of the ground. Today, the lounging pools along the river are gone, but hot water still seeps out of the rocks before merging into the icy-cold waters of the Ohanapecosh River. The trail takes off from the visitor center and wanders through the lush, moss-laden forests on the east bank of the Ohanapecosh River. The trail is well graded and easy to walk, even for kids with short legs and shorter attention spans. The route explores some wonderful forest environments, with a variety of plant life to examine.",
  "url": "http://www.wta.org/go-hiking/hikes/ohanapecosh-hot-springs",
},

{
  "title": "Rainier View",
  "location": "Mount Rainier Area",
  "rating": "4.2",
  "distance": "2.4",
  "elevation": "300",
  "description": "This is a great hike for kids with lots to see including wild flowers, big views of Mt. Rainier and maybe even some wildlife including marmots and goats. Take a picnic and enjoy the wonderful sights along this trail. The Rainier View trail starts up gently from the Corral Pass parking area. The trail ascends through the little used Corral Pass Campground at a gentle grade. The easy path ascends very gently through thin stands of tall, pointed alpine trees, and soon comes to the one and only switchback on the whole route. Passing through forest and meadows after a mile or so it breaks out on top of the northwest ridge of Castle Mountain.",
  "url": "http://www.wta.org/go-hiking/hikes/rainier-view",
},
]
