[
  {
    "name": "Eagle Lake Fisherman's Trail",
    "location": "Central Cascades",
    "rating": "4.0",
    "distance": "5.0",
    "elevation": "712",
    "description": "Historically, the most frequent approach to Eagle Lake has been via a scramble from Barclay Lake that is not suitable for most hikers. One story holds that Harvey Manning -- angry that logging in the lower Eagle Creek basin made road access to Eagle Lake via the Fisherman's route too easy -- intentionally omitted directions to this trailhead in his guidebook. The roadside parking area is marked with a “National Forest Wilderness” sign that bears a map of the region. The sign erroneously indicates “Barclay Lake #1055,” but knowledgeable hikers have indicated the location of the trailhead and the trail route with black marker. If you see this wrong sign, then you are in the right place!",
    "url": "http://www.wta.org/go-hiking/hikes/eagle-lake-fishermans-trail"
  },
  {
    "name": "Windy Pass - Mount Catherine Snowshoe",
    "location": "Snoqualmie Pass",
    "rating": "3.0",
    "distance": "9.0",
    "elevation": "2300",
    "description": "A connector trail on Tiger Mountain. Access to or from West Tiger 3, Nook Trail, and Section Line Trail.",
    "url": "http://www.wta.org/go-hiking/hikes/windy-pass-mount-catherine-snowshoe"
  },
  {
    "name": "Joe Lake",
    "location": "Snoqualmie Pass",
    "rating": "4.1",
    "distance": "16.0",
    "elevation": "2235",
    "description": "This hike has a little bit of everything.To reach Little Joe Lake, hike Gold Creek Trail with gradual ups and downs to the Alaska Lake turnoff at about 5 miles. The main trail goes left and uphill to Alaska Lake. Take the other way. The Joe Lake trail starts here and goes straight ahead into the open meadows of slide alder and vine maple. This is where the work begins as the trail is no longer maintained past this point. Follow this rough trail around Alaska Mountain paying careful attention to where the main trail is (survey tape in trees marks the way). You will have to duck, crawl, and plow your way through this tangle of brush and the occasional downed log. Watch your step as there are lots of rocks in the trail that will twist an ankle. It's a pretty tedious trek through here so slow down and take your time. After about two miles, you will encounter a beautiful waterfall on your left. Once you cross the water you'll be on the right side the waterfall and the trail is no nonsense at this point. It goes straight up. You will not need hiking poles and coming back down almost guarantees removal of your pack and sliding it down in front of you with a rope. Once you have made it to the top, a plethora of campsites await you and if you are there in midsummer, squadrons of mosquitoes. Aside from the lake and meadows surrounding the lake, there are also several small ponds surrounding the lake. -Side trip 1, at the Alaska Lake trail, there is an abandoned gold mine about 500' above the valley bottom. Look for it to the right of the Alaska Lake Trail. You can only see it from the bottom of the hill. Take a good look at where it is and then look for a faint trail that leads that direction off the Alaska Lake Trail. The mine has about 6 of water in it during the summer and can be explored without flashlights. -Side trip 2 once at Joe Lake, the crest trail is a few hundred feet above the lake, the short route up is at the opposite end of the lake through the trees, but the no nonsense route up is right up the steep meadow or chute at the base of Huckleberry mountain. To the North of the lake on the PCT, there are numerous meadows and ponds to explore. Views are pretty good too.",
    "url": "http://www.wta.org/go-hiking/hikes/little-joe-lake",
  },
  {
    "name": "Lake Laura Backdoor",
    "location": "Snoqualmie Pass",
    "rating": "3.0",
    "distance": "3.0",
    "elevation": "1000",
    "description": "A short, beautiful, but very steep trail to Lake Laura and Lake Lillian. Gets you there in a quarter of the time, but breathing just as hard. The trail itself starts out in heavy brush, but the thread is obvious. It crosses a minor creek, and starts the climb.",
    "url": "http://www.wta.org/go-hiking/hikes/lake-laura-backdoor",
  },
  {
    "name": "Gold Creek-Alaska Lake",
    "location": "Snoqualmie Pass",
    "rating": "2.1",
    "distance": "11.0",
    "elevation": "1600",
    "description": "Early in the season, head here. This trail is haphazardly maintained and routefinding on its upper stretches can (and does) prove difficult. But for good routefinders and those who don't mind an occasional deadfall, it's a good early-season route to the high country of Alaska Lake. Even hikers who opt not to push on to Alaska Lake will enjoy the valley hike as it explores the creek basin and its multitude of beaver ponds and flower-filled clearings. The route follows the road as it heads north, deeper into the Gold Creek valley. Land on both sides of this road is privately owned, so don't wander off it for the first 0.5 mile. Past the end of the maintained road you'll find yourself on an old, abandoned miners track. This fading roadway peters out in another 0.25 mile, leaving you on a wide single-track trail",
    "url": "http://www.wta.org/go-hiking/hikes/alaska-lake",
  },
  {
    "name": "Franklin Falls",
    "location": "Snoqualmie Pass",
    "rating": "4.0",
    "distance": "2.0",
    "elevation": "400",
    "description": "Hiking with kids, new to hiking, or just looking for an easy day hike with a spectacular endpoint? Look no further than Franklin Falls! At just 2 miles roundtrip with 400 feet in elevation gain it is the perfect destination for any hiker looking for something easy and beautiful.",
    "url": "http://www.wta.org/go-hiking/hikes/franklin-falls",
  },
  {
    "name": "Lodge Lake",
    "location": "Snoqualmie Pass",
    "rating": "4.0",
    "distance": "3.0",
    "elevation": "500",
    "description": "The trail climbs gradually through scrubby forest for 0.5 mile as it makes its way from the freeway corridor. Abruptly, the path erupts out of the trees onto the smooth grassy slopes of the ski runs.",
    "url": "http://www.wta.org/go-hiking/hikes/lodge-lake",
  },
  {
    "name": "Humpback Mountain",
    "location": "Snoqualmie Pass",
    "rating": "3.5",
    "distance": "4.0",
    "elevation": "2500",
    "description": "This secluded hike off I-90 follows the NW ridge through small and then large trees to the top of Humpback mountain. The summit provides great views in all directions. This is a great snowshoeing trip in the winter. ",
    "url": "http://www.wta.org/go-hiking/hikes/humpback-mountain",
  },
  {
    "name": "Annette Lake",
    "location": "Snoqualmie Pass",
    "rating": "3.5",
    "distance": "7.5",
    "elevation": "1400",
    "description": "Waterfalls, wildflowers, sheltering forests, mountain views and an alpine lake are offered on this well-maintained trail. At the lake, enjoy the sights and relax for a while. If you backpacked in, stay at the campsites for a sunrise and sunset on the lake.",
    "url": "http://www.wta.org/go-hiking/hikes/annette-lake",
  },
  {
    "name": "Talapus and Olallie Lakes",
    "location": "Snoqualmie Pass",
    "rating": "3.2",
    "distance": "6.2",
    "elevation": "1220",
    "description": "With a moderate grade on a wide trail, the hike to Talapus Lake is the perfect introduction to the outdoors for hikers and beginning backpackers. Upon arrival at Talapus, break out lunch or pitch camp. Either way, you can cool off in the large lake. If you feel like pressing on, Ollalie Lake is just about a mile and a half up trail, where open campsites offer lakeside havens with calm waters and views of a beautiful lake basin.",
    "url": "http://www.wta.org/go-hiking/hikes/talapus-lake",
  },
  {
    "name": "Mount Margaret",
    "location": "Snoqualmie Pass",
    "rating": "4.0",
    "distance": "6.0",
    "elevation": "1500",
    "description": "N/A",
    "url": "http://www.wta.org/go-hiking/hikes/mount-margaret",
  }

]
