[
  {
    "name": "Eagle Lake Fisherman's Trail",
    "location": "Central Cascades",
    "rating": "4.0",
    "distance": "5.0",
    "elevation": "712",
    "description": "Historically, the most frequent approach to Eagle Lake has been via a scramble from Barclay Lake that is not suitable for most hikers. One story holds that Harvey Manning -- angry that logging in the lower Eagle Creek basin made road access to Eagle Lake via the Fisherman's route too easy -- intentionally omitted directions to this trailhead in his guidebook. The roadside parking area is marked with a “National Forest Wilderness” sign that bears a map of the region. The sign erroneously indicates “Barclay Lake #1055,” but knowledgeable hikers have indicated the location of the trailhead and the trail route with black marker. If you see this wrong sign, then you are in the right place!",
    "url": "http://www.wta.org/go-hiking/hikes/eagle-lake-fishermans-trail"
  },
  {
   "name": "Little Wenatchee Gorge",
   "location": "Central Cascades",
   "rating": "3.2",
   "distance": "3.0",
   "elevation": "250",
   "description": "Perhaps the best kept secret among the scores of trails within the Lake Wenatchee region, this one follows along the Little Wenatchee River at a dramatic gorge. A wonderful destination for hikers of all ages and abilities, the river puts on quite a show as it tumbles and froths over rapids and beneath ledges. Amble or while away the afternoon, or combine this hike with one of the other nearby short but sweet trails. The trail takes off south from the quiet campground and then immediately swings west. The spur that continues south follows Elevenmile Creek for a short distance to the Little Wenatchee River. It's not a bad diversion if you miss the turn. The main trail, however, continues across a bench of hemlock and huckleberry, shortly meeting up with the river at an inviting spot that encourages napping and picnicking. Directly across from the pristine waterway, Theseus Creek tumbles into it by a small campsite.",
   "url": "http://www.wta.org/go-hiking/hikes/little-wenatchee-river"
 },
 {
   "name": "Blanca Lake",
   "location": "Central Cascades",
   "rating": "4.4",
   "distance": "7.5",
   "elevation": "3300",
   "description": "Visit one of the most striking lakes in the Henry M. Jackson wilderness. The vibrant blue of the glacier-fed lake provides the perfect rest stop for hikers who have braved the thirty-odd, steep switchbacks that lead to the lake. If you can tear your eyes away from the trail, the view will take your breath away. Across the valley is the foot of Columbia Peak, and ss you round the last point, beautiful Blanca Lake opens up in all her glory. The lake is framed to the north by the peaks of Monte Cristo, Columbia, and Keyes. More than a few hikers have been known to gasp aloud when they round the corner and see the robin-egg blue waters.",
   "url": "http://www.wta.org/go-hiking/hikes/blanca-lake"
 },
 {
   "name": "Scorpion Mountain",
   "location": "Central Cascades",
   "rating": "NA",
   "distance": "8.0",
   "elevation": "2500",
   "description": "Scorpion Mountain offers a 360-degree view of the Central Cascades, and the huckleberries and blueberries make this a much underrated fall hike. The trail seems like a gentle climb up to the rounded top of Scorpion Mountain where there is room for lots of hikers, but, in the fall, it is often not crowded. Find a place to sit and eat lunch, and then turn around and enjoy the view on the other side.",
   "url": "http://www.wta.org/go-hiking/hikes/scorpion-mountain"
 },
 {
   "name": "Mount Persis",
   "location": "Central Cascades",
   "rating": "3.8",
   "distance": "4.0",
   "elevation": "2658",
   "description": "Be prepared: this is not an easy hike. More a bootpath than a real trail, the route occasionally disappears in the undergrowth. The trail is also very steep in places, requiring a little help from nearby trees to make your way up. But the views are incredible; just don’t let the short mileage fool you, and plan on spending a few extra hours tackling this one. Once you reach the summit of Persis, soak up the expansive views. Neighboring Index is massive. Pick out Baring, Mt. Baker, Gunn Peak, and Mt. Rainier. The exposed granite of the Index Town Wall is easy to spot above the miniature town of Index, and Heybrook Ridge sits just under Mt. Baring. The 360-degree views offer plenty to see before starting the steep slog back down the mountain.",
   "url": "http://www.wta.org/go-hiking/hikes/mount-persis"
 },
 {
   "name": "Bridal Veil Falls",
   "location": "Central Cascades",
   "rating": "4.0",
   "distance": "4.0",
   "elevation": "1000",
   "description": "Beautiful waterfall flows out of Lake Serene and cascades below the rugged east wall of Mount Index at the end ofa trail on the west side of Bridal Veil Creek. Take time to see and enjoy a stunning view of Bridal Veil Falls and climb flights of steps paralleling the falls. Children will be fascinated as they stand directly beside the water and look up a 100-foot rock face to see the streams of water that make up the bridal veil pouring beside them. An old nearby mine, the Honeymoon Mine, brought the original nineteenth-century travelers to the Lake Serene area.",
   "url": "http://www.wta.org/go-hiking/hikes/bridal-veil-falls"
 },
 {
    "name": "Poe Mountain via Irving Pass",
    "location": "Central Cascades",
    "rating": "3.7",
    "distance": "5.0",
    "elevation": "1800",
    "description": "There are two trails to Poe Mountain: the original steep supply route to the retired fire lookout via a trail rising from the Little Wenatchee Falls campground (#1520), and the more moderate trail via the Irving Pass Trail. Both trails are two and a half miles long, but the one beginning at Little Wenatchee Falls campground gains a full 3000 feet in elevation. It's guaranteed to get your heart pounding, but Irving Pass is the recommended route, since you spend a significant amount of the hike on the ridge with awesome views both north and south.",
    "url": "http://www.wta.org/go-hiking/hikes/irving-pass"
  },
  {
    "name": "Minotaur Lake",
    "location": "Central Cascades",
    "rating": "3.2",
    "distance": "3.5",
    "elevation": "1905",
    "description": "Tucked in a cirque a few miles east of Stevens Pass are Minotaur Lake, its immediate neighbor Theseus and overlooking Labyrinth Mountain. This group of alpine destinations, named for symbols in the Greek mythos, make for a great day hike and an excellent workout.",
    "url": "http://www.wta.org/go-hiking/hikes/minotaur-lake"
  },
  {
    "name": "Quartz Creek",
    "location": "Central Cascades",
    "rating": "2.2",
    "distance": "8.4",
    "elevation": "1500",
    "description": "This trail is commonly used by backpackers, but it also makes a great day hike. Hike through shady forest, accompanied by the sound of Quartz Creek, little waterfalls, wildflowers and interesting things to see (and eat) on this trail. Just make sure you know that you CAN eat it! Start out paralleling the creek, and after a couple of miles, leave the creek and gently climb to Curry Gap. Be aware of brushy areas that will soak your pants when wet, as well as one tricky stream crossing, where there is a large pool and some slippery rocks. Curry Gap is a big meadow. where 3 trails meet. There is a nice log in the meadow to eat lunch, and contemplate adventuring up one of these three options. Try Bald Eagle Mountain for mountain views when it's clear.",
    "url": "http://www.wta.org/go-hiking/hikes/quartz-creek-1"
  },
  {
    "name": "Jumpoff Ridge",
    "location": "Central Cascades",
    "rating": "NA",
    "distance": "8.0",
    "elevation": "1800",
    "description": "NA",
    "url": "http://www.wta.org/go-hiking/hikes/jumpoff-ridge"
  },
  {
    "name": "Grace Lakes",
    "location": "Central Cascades",
    "rating": "4.6",
    "distance": "4.0",
    "elevation": "500",
    "description": "During the summer, this hike is an easy walk up a relatively steep service road on the west side of the mountain. It's short, Snowshoeing - The trail is a gradual uphill climb, mostly over a road, to a basin with Grace Lake. Park in Stevens Pass Ski Area lot 4 and follow the groomed trail/road past the Mountaineer's cabin. Where the gooming ends, follow the trail to the right. The trail mostly follows a road, and the road is sometimes a Sno-Cat track to provide access for Highway 2 avalanche control.",
    "url": "http://www.wta.org/go-hiking/hikes/grace-lakes"
  },
  {
    "name": "Evans Lake",
    "location": "Central Cascades",
    "rating": "3.0",
    "distance": "1.0",
    "elevation": "50",
    "description": "A long, albeit decent logging road to a short, albeit pleasant trail, the trip to Evans Lake makes for a quick wilderness fix. Come here to snow probe in early season, berry pick in late summer, or reflect in late fall. Except perhaps for a few anglers, it should just be you and the frogs and the dragonflies at this little lake. The wide and well-groomed path immediately enters ancient forest and the Alpine Lakes Wilderness. Back in the logging frenzy of the 1980s and early '90s, the congressionally set wilderness border was all that kept these old trees surrounding Evans Lake from becoming lumber. Following alongside the gently flowing outlet creek, reach the lake within mere minutes. Ringed by grassy shores and old-growth trees, it's a pleasant spot.",
    "url": "http://www.wta.org/go-hiking/hikes/evans-lake-1"
  },
  {
    "name": "Deception Creek",
    "location": "Central Cascades",
    "rating": "4.0",
    "distance": "11.0",
    "elevation": "1200",
    "description": "Everything that makes a river hike fun is here, cool bridges, waterfalls, big trees, lots of dripping moss, and mushrooms.",
    "url": "http://www.wta.org/go-hiking/hikes/deception-creek"
  },
  {
    "name": "Mount Baring",
    "location": "Central Cascades",
    "rating": "4.0",
    "distance": "7.0",
    "elevation": "3500",
    "description": "The unofficial Mount Baring trail shares the parking lot with the Barclay lake trail. A fairly well used climber's trail goes straight up, and up, and then up Mount Baring. The trail requires moderate navigational skills and possibly climbing equipment in bad weather. After roughly 2000' in gain over a little over a mile one reach the ridge line. More significant climbing brings one to a notch. Ascent of this gully will vary with snow conditions and experience. An ice ax is recommended during the spring and summer. After gaining a hundred feet or so the angle eases off and a cairned trail leads to the summit.",
    "url": "http://www.wta.org/go-hiking/hikes/mount-baring"
  },
  {
    "name":"Evergreen Mountain Lookout",
    "location": "Central Cascades",
    "rating": "3.2",
    "distance": "2.8",
    "elevation": "1425",
    "description": "short but stiff climb through an old burn, old growth forest, and alpine meadows to a restored fire lookout standing sentinel over the western flanks of the Wild Sky Wilderness. Stuart, Daniel, Hinman and other Snoqualmie friends lie to the south with Rainier watching over them all. To the west, view the gems of Wild Sky - Merchant, Gunn, and Spire – and to the north, gaze upon the Monte Cristo massif, Sloan, and Whitehorse. The meadows of Fortune and Grizzly backed by the Poet Peaks and Nason Ridge round our your view to the east.",
    "url": "http://www.wta.org/go-hiking/hikes/evergreen-mountain-lookout"
  },
  {
    "name": "Wellington Ghost Town",
    "location": "Central Cascades",
    "rating": "NA",
    "distance": "2.0",
    "elevation": "20",
    "description": "The town of Wellington ceased to be, at least in name, long before it officially became a ghost town. The town was founded in 1893 at the west portal of the Cascade Tunnel along the Great Northern Railway. The town included a train depot that was unfortunately destined to become the site of the deadliest avalanche in US history. On March 1, 1910, a passenger train and a mail train were stuck at the Wellington Depot waiting out a blizzard that had been raging for nine days. During the night, while most people were sleeping, an avalanche hit the trains and the station quickly sweeping everything about 150 feet downhill into the Tye River valley. 96 people were killed in the event. Only 23 survived. In October of 1910 Wellington was quietly renamed Tye to ease the fears of travelers who would forever associate the name Wellington with this tragic event.",
    "url": "http://www.wta.org/go-hiking/hikes/wellington-ghost-town"
  },
  {
    "name": "Lanham Lake",
    "location": "Central Cascades",
    "rating": "2.0",
    "distance": "3.2",
    "elevation": "1140",
    "description": "A small lake under a big mountain, reached by a short trail alongside a pretty creek shaded by old trees-Lanham makes for a good afternoon hike or a nice break from traveling busy US 2. A popular winter snowshoe destination, the lake is fairly peaceful during the summer. Visit in June when lake and creek levels are high and the forest is alive with avian arias.",
    "url": "http://www.wta.org/go-hiking/hikes/lanham-lake"
  },
  {
    "name": "Glasses Lake",
    "location": "Central Cascades",
    "rating": "NA",
    "distance": "10.0",
    "elevation": "700",
    "description": "asses Lake is an add on destination from Heather Lake (#1526) near Lake Wenatchee. This is a beautiful small lake tucked immediately under Grizzly Peak and the Pacific Crest Trail (PCT). Where Heather Lake is often shared with a number of hiking and camping groups, you are pretty much assured to have lunch by yourself at Glasses. Only a half-dozen trip reports have been filed in the last decade, this is a good predictor of solitude.",
    "url": "http://www.wta.org/go-hiking/hikes/glasses-lake"
  },
  {
    "name": "Dirtyface Lookout and Peak",
    "location": "Central Cascades",
    "rating": "3.1",
    "distance": "9.0",
    "elevation": "3950",
    "description": "DirtyFace Lookout is one of the earliest high Central Cascade trails to melt out. At four miles and with 4000 feet of elevation gain, the trail provides hikers with a very good workout. Along the way, you'll have lots to look at, as the elevation change can roll an entire season of wildflowers into a single hike. Rock roses and paintbrush bob near the trailhead, while avalanche lilys sway in the breeze near the summit. When you aren't looking at the wildflowers, the vistas are outstanding.",
    "url": "http://www.wta.org/go-hiking/hikes/dirtyface-lookout-site"
  },
  {
    "name": "Windy Pass - Mount Catherine Snowshoe",
    "location": "Snoqualmie Pass",
    "rating": "3.0",
    "distance": "9.0",
    "elevation": "2300",
    "description": "A connector trail on Tiger Mountain. Access to or from West Tiger 3, Nook Trail, and Section Line Trail.",
    "url": "http://www.wta.org/go-hiking/hikes/windy-pass-mount-catherine-snowshoe"
  },
  {
    "name": "Joe Lake",
    "location": "Snoqualmie Pass",
    "rating": "4.1",
    "distance": "16.0",
    "elevation": "2235",
    "description": "This hike has a little bit of everything.To reach Little Joe Lake, hike Gold Creek Trail with gradual ups and downs to the Alaska Lake turnoff at about 5 miles. The main trail goes left and uphill to Alaska Lake. Take the other way. The Joe Lake trail starts here and goes straight ahead into the open meadows of slide alder and vine maple. This is where the work begins as the trail is no longer maintained past this point. Follow this rough trail around Alaska Mountain paying careful attention to where the main trail is (survey tape in trees marks the way). You will have to duck, crawl, and plow your way through this tangle of brush and the occasional downed log. Watch your step as there are lots of rocks in the trail that will twist an ankle. It's a pretty tedious trek through here so slow down and take your time. After about two miles, you will encounter a beautiful waterfall on your left. Once you cross the water you'll be on the right side the waterfall and the trail is no nonsense at this point. It goes straight up. You will not need hiking poles and coming back down almost guarantees removal of your pack and sliding it down in front of you with a rope. Once you have made it to the top, a plethora of campsites await you and if you are there in midsummer, squadrons of mosquitoes. Aside from the lake and meadows surrounding the lake, there are also several small ponds surrounding the lake. -Side trip 1, at the Alaska Lake trail, there is an abandoned gold mine about 500' above the valley bottom. Look for it to the right of the Alaska Lake Trail. You can only see it from the bottom of the hill. Take a good look at where it is and then look for a faint trail that leads that direction off the Alaska Lake Trail. The mine has about 6 of water in it during the summer and can be explored without flashlights. -Side trip 2 once at Joe Lake, the crest trail is a few hundred feet above the lake, the short route up is at the opposite end of the lake through the trees, but the no nonsense route up is right up the steep meadow or chute at the base of Huckleberry mountain. To the North of the lake on the PCT, there are numerous meadows and ponds to explore. Views are pretty good too.",
    "url": "http://www.wta.org/go-hiking/hikes/little-joe-lake"
  },
  {
    "name": "Lake Laura Backdoor",
    "location": "Snoqualmie Pass",
    "rating": "3.0",
    "distance": "3.0",
    "elevation": "1000",
    "description": "A short, beautiful, but very steep trail to Lake Laura and Lake Lillian. Gets you there in a quarter of the time, but breathing just as hard. The trail itself starts out in heavy brush, but the thread is obvious. It crosses a minor creek, and starts the climb.",
    "url": "http://www.wta.org/go-hiking/hikes/lake-laura-backdoor"
  },
  {
    "name": "Gold Creek-Alaska Lake",
    "location": "Snoqualmie Pass",
    "rating": "2.1",
    "distance": "11.0",
    "elevation": "1600",
    "description": "Early in the season, head here. This trail is haphazardly maintained and routefinding on its upper stretches can (and does) prove difficult. But for good routefinders and those who don't mind an occasional deadfall, it's a good early-season route to the high country of Alaska Lake. Even hikers who opt not to push on to Alaska Lake will enjoy the valley hike as it explores the creek basin and its multitude of beaver ponds and flower-filled clearings. The route follows the road as it heads north, deeper into the Gold Creek valley. Land on both sides of this road is privately owned, so don't wander off it for the first 0.5 mile. Past the end of the maintained road you'll find yourself on an old, abandoned miners track. This fading roadway peters out in another 0.25 mile, leaving you on a wide single-track trail",
    "url": "http://www.wta.org/go-hiking/hikes/alaska-lake"
  },
  {
    "name": "Franklin Falls",
    "location": "Snoqualmie Pass",
    "rating": "4.0",
    "distance": "2.0",
    "elevation": "400",
    "description": "Hiking with kids, new to hiking, or just looking for an easy day hike with a spectacular endpoint? Look no further than Franklin Falls! At just 2 miles roundtrip with 400 feet in elevation gain it is the perfect destination for any hiker looking for something easy and beautiful.",
    "url": "http://www.wta.org/go-hiking/hikes/franklin-falls"
  },
  {
    "name": "Lodge Lake",
    "location": "Snoqualmie Pass",
    "rating": "4.0",
    "distance": "3.0",
    "elevation": "500",
    "description": "The trail climbs gradually through scrubby forest for 0.5 mile as it makes its way from the freeway corridor. Abruptly, the path erupts out of the trees onto the smooth grassy slopes of the ski runs.",
    "url": "http://www.wta.org/go-hiking/hikes/lodge-lake"
  },
  {
    "name": "Humpback Mountain",
    "location": "Snoqualmie Pass",
    "rating": "3.5",
    "distance": "4.0",
    "elevation": "2500",
    "description": "This secluded hike off I-90 follows the NW ridge through small and then large trees to the top of Humpback mountain. The summit provides great views in all directions. This is a great snowshoeing trip in the winter. ",
    "url": "http://www.wta.org/go-hiking/hikes/humpback-mountain"
  },
  {
    "name": "Annette Lake",
    "location": "Snoqualmie Pass",
    "rating": "3.5",
    "distance": "7.5",
    "elevation": "1400",
    "description": "Waterfalls, wildflowers, sheltering forests, mountain views and an alpine lake are offered on this well-maintained trail. At the lake, enjoy the sights and relax for a while. If you backpacked in, stay at the campsites for a sunrise and sunset on the lake.",
    "url": "http://www.wta.org/go-hiking/hikes/annette-lake"
  },
  {
    "name": "Talapus and Olallie Lakes",
    "location": "Snoqualmie Pass",
    "rating": "3.2",
    "distance": "6.2",
    "elevation": "1220",
    "description": "With a moderate grade on a wide trail, the hike to Talapus Lake is the perfect introduction to the outdoors for hikers and beginning backpackers. Upon arrival at Talapus, break out lunch or pitch camp. Either way, you can cool off in the large lake. If you feel like pressing on, Ollalie Lake is just about a mile and a half up trail, where open campsites offer lakeside havens with calm waters and views of a beautiful lake basin.",
    "url": "http://www.wta.org/go-hiking/hikes/talapus-lake"
  },
  {
    "name": "Mount Margaret",
    "location": "Snoqualmie Pass",
    "rating": "4.0",
    "distance": "6.0",
    "elevation": "1500",
    "description": "N/A",
    "url": "http://www.wta.org/go-hiking/hikes/mount-margaret"
  },

  {
  "name": "Greenwater and Echo Lakes",
  "location": "Mount Rainier Area",
  "rating": "3.0",
  "distance": "14.0",
  "elevation": "1900",
  "description": "Visit a trail where rushing rivers, placid lakes, and wild forests line the trail. The Greenwater River is your constant companion on this hike, winding with you through cool, old-growth forest along this quiet path to two basin lakes. As you walk, watch for the deer and elk that make this area their home. This trail is also used by equestrians, Horse fords for crossing the river are clearly marked with charming wood signs. Be sure to share the trail accordingly!",
  "url": "http://www.wta.org/go-hiking/hikes/greenwater-lakes"
  },
  {
    "name": "Tipsoo Lake-Naches Peak Loop",
    "location": "Mount Rainier Area",
    "rating": "4.1",
    "distance":"3.2",
    "elevation":"600",
    "description": "This popular hike provides a range of alpine experiences in a short loop. Walk along a hillside above a small valley, pause at a viewpoint overlooking a lake, and stroll through grassy meadows with stunning views of Mount Rainier. In season enjoy an abundance of wildflowers or perhaps a handful of huckleberries. The hike follows the Pacific Crest Trail on the northern flank of Naches Peak and the Naches Peak Trail on the southern flank. The loop is best done clockwise for outstanding views of Mount Rainier.",
    "url": "http://www.wta.org/go-hiking/hikes/naches-peak-loop"
  },

  {
    "name": "Shriner Peak",
    "location": "Mount Rainier Area",
    "rating": "3.0",
    "distance": "8.5",
    "elevation": "3434",
    "description": "The under-appreciated Shriner Peak is one of the loneliest trails at Mount Rainier. It's long, steep, and exposed, making it nearly intolerable in the stale summer heat. But enter fall, when the change of season ushers in majestic color and cooler temps, it's the ideal time to hit this high-alpine trail before the snow starts falling again. From the get-go, the Shriner Peak Trail steadily ascends 3,424 feet in 4.25 miles. Bring lots of water--you'll need it , and there aren't many sources along the way. The trail runs parallel to Panther Creek through shade Douglas-fir, cedar, and hemlock for 0.75 miles before entering an old burn area. Traverse this shadeless stretch for another mile to a steep series of switchbacks to the top of a ridge under Shriner Peak. ",
    "url": "http://www.wta.org/go-hiking/hikes/shriner-peak"
  },

  {
    "name": "Ohanapecosh Hot Springs",
    "location": "Mount Rainier Area",
    "rating": "4.0",
    "distance": "1.0",
    "elevation": "50",
    "description": "Early tourists flocked to Ohanapecosh not because it was so spectacularly pretty, but because of the water. More specifically, because of the hot water burbling out of the ground. Today, the lounging pools along the river are gone, but hot water still seeps out of the rocks before merging into the icy-cold waters of the Ohanapecosh River. The trail takes off from the visitor center and wanders through the lush, moss-laden forests on the east bank of the Ohanapecosh River. The trail is well graded and easy to walk, even for kids with short legs and shorter attention spans. The route explores some wonderful forest environments, with a variety of plant life to examine.",
    "url": "http://www.wta.org/go-hiking/hikes/ohanapecosh-hot-springs"
  },

  {
    "name": "Rainier View",
    "location": "Mount Rainier Area",
    "rating": "4.2",
    "distance": "2.4",
    "elevation": "300",
    "description": "This is a great hike for kids with lots to see including wild flowers, big views of Mt. Rainier and maybe even some wildlife including marmots and goats. Take a picnic and enjoy the wonderful sights along this trail. The Rainier View trail starts up gently from the Corral Pass parking area. The trail ascends through the little used Corral Pass Campground at a gentle grade. The easy path ascends very gently through thin stands of tall, pointed alpine trees, and soon comes to the one and only switchback on the whole route. Passing through forest and meadows after a mile or so it breaks out on top of the northwest ridge of Castle Mountain.",
    "url": "http://www.wta.org/go-hiking/hikes/rainier-view"
  },
  {
    "name": "Tipsoo Lake-Naches Peak Loop",
    "location": "Mount Rainier Area",
    "rating": "4.1",
    "distance":"3.2",
    "elevation":"600",
    "description": "This popular hike provides a range of alpine experiences in a short loop. Walk along a hillside above a small valley, pause at a viewpoint overlooking a lake, and stroll through grassy meadows with stunning views of Mount Rainier. In season enjoy an abundance of wildflowers or perhaps a handful of huckleberries. The hike follows the Pacific Crest Trail on the northern flank of Naches Peak and the Naches Peak Trail on the southern flank. The loop is best done clockwise for outstanding views of Mount Rainier.",
    "url": "http://www.wta.org/go-hiking/hikes/naches-peak-loop"
  },

  {
    "name": "Shriner Peak",
    "location": "Mount Rainier Area",
    "rating": "3.0",
    "distance": "8.5",
    "elevation": "3434",
    "description": "The under-appreciated Shriner Peak is one of the loneliest trails at Mount Rainier. It's long, steep, and exposed, making it nearly intolerable in the stale summer heat. But enter fall, when the change of season ushers in majestic color and cooler temps, it's the ideal time to hit this high-alpine trail before the snow starts falling again. From the get-go, the Shriner Peak Trail steadily ascends 3,424 feet in 4.25 miles. Bring lots of water--you'll need it , and there aren't many sources along the way. The trail runs parallel to Panther Creek through shade Douglas-fir, cedar, and hemlock for 0.75 miles before entering an old burn area. Traverse this shadeless stretch for another mile to a steep series of switchbacks to the top of a ridge under Shriner Peak. ",
    "url": "http://www.wta.org/go-hiking/hikes/shriner-peak"
  },

  {
    "name": "Ohanapecosh Hot Springs",
    "location": "Mount Rainier Area",
    "rating": "4.0",
    "distance": "1.0",
    "elevation": "50",
    "description": "Early tourists flocked to Ohanapecosh not because it was so spectacularly pretty, but because of the water. More specifically, because of the hot water burbling out of the ground. Today, the lounging pools along the river are gone, but hot water still seeps out of the rocks before merging into the icy-cold waters of the Ohanapecosh River. The trail takes off from the visitor center and wanders through the lush, moss-laden forests on the east bank of the Ohanapecosh River. The trail is well graded and easy to walk, even for kids with short legs and shorter attention spans. The route explores some wonderful forest environments, with a variety of plant life to examine.",
    "url": "http://www.wta.org/go-hiking/hikes/ohanapecosh-hot-springs"
  },

  {
    "name": "Rainier View",
    "location": "Mount Rainier Area",
    "rating": "4.2",
    "distance": "2.4",
    "elevation": "300",
    "description": "This is a great hike for kids with lots to see including wild flowers, big views of Mt. Rainier and maybe even some wildlife including marmots and goats. Take a picnic and enjoy the wonderful sights along this trail. The Rainier View trail starts up gently from the Corral Pass parking area. The trail ascends through the little used Corral Pass Campground at a gentle grade. The easy path ascends very gently through thin stands of tall, pointed alpine trees, and soon comes to the one and only switchback on the whole route. Passing through forest and meadows after a mile or so it breaks out on top of the northwest ridge of Castle Mountain.",
    "url": "http://www.wta.org/go-hiking/hikes/rainier-view"
  },

  {
    "name": "Mystic Lake",
    "location": "Mount Rainier Area",
    "rating": "2.7",
    "distance": "18",
    "elevation": "2520",
    "description": "This is a trail where the journey is as interesting as the destination. Enjoy a beautiful waterfall and views of icy Winthrop Glacier. Gaze directly at Mount Rainier and witness the fascinating destruction caused by the floods of 2006. All of this is chased by the peaceful basin of Mystic Lake and surrounding meadows. Find the Sourdough Ridge trail near the restrooms on the north side of the parking area. Climb through a meadow to a junction with the Sourdough Ridge Trail, where you head left (east) toward Frozen Lake. At Frozen Lake follow the signs for the Wonderland Trail westbound. At 3.1 miles from the trailhead crest the ridgeline for Skyscraper Pass, where Mount Rainier looks so close you could touch it. Descend from Skyscraper Pass into the trees and at 4.4 miles reach Granite Creek wilderness camp. Flat spots to rest, water to filter and a backcountry latrine are all here if you need them.",
    "url": "http://www.wta.org/go-hiking/hikes/mystic-lake"
  },

  {
    "name": "Palisades Lakes",
    "location": "Mount Rainer Area",
    "rating": "3.1",
    "distance": "7.5",
    "elevation": "1800",
    "description": "Seven lakes, seas of wildflowers, summer huckleberries, a bevy of wildlife and a good chance of quiet solitude await you on this 9-mile out-and-back. What more could you ask for? While the throngs of summer visitors are heading to the end of the road at Sunrise Point, pull off into the corner viewpoint parking area near the top. The trail starts across the road and heads downhill to Sunrise Lake, the first of many you’ll encounter. It’s nice, but keep going. Passing over rocky sections of trail, listen and look for pikas; if you’re quiet you’ll be able to spot them. At 1.5 miles is Clover Lake. Here you’ll find an array of wildflowers surrounding the lake. Again, nice, but you’ll want to keep going.",
    "url": "http://www.wta.org/go-hiking/hikes/palisades-lakes"
  },

  {
    "name": "Norse Peak",
    "location": "Mount Rainer Area",
    "rating": "4",
    "distance": "10.6",
    "elevation": "2800",
    "description": "Hike here in summer and you'll want to pack several quarts of water, then toss in two more once you've got all you think you'll need. And you'll want to be hydrated and feeling good, because the scenery along these parched slopes will be something you'll want to see and remember for a long time. When you tire of the rainbow of wildflowers on the ground, you can look up to find breathtaking vistas around every corner. Herds of elk frequent the meadows, and mountain goats dance and prance around the rocks at the ridge top. Hawks and golden eagles soar overhead, and small snakes and alligator lizards live on the sun-heated slopes underfoot.",
    "url": "http://www.wta.org/go-hiking/hikes/norse-peak"
  },

  {
    "name": "Crystal Peak",
    "location": "Mount Rainer Area",
    "rating": "4",
    "distance": "8",
    "elevation": "3100",
    "description": "Check the weather before heading out for this hike, and if it’s going to be clear, bring a camera. From the summit, it’s possible to see six (yes, six!) volcanoes spanning two states. Baker, Glacier, Adams, Rainier, St. Helens and Hood wait patiently for you to climb the more-than-moderately steep path to the summit of Crystal Peak, where you can take in beautiful snow-capped majesty from the top. Begin at an unmarked trailhead on the left-hand side of Highway 410. The trail immediately crosses a delightful stream, which you’ll be even more thankful for on the way down; it’s a great spot to stop and dip your feet after four miles of relentless downhill. Cross the water using a footlog with a handrail, and get ready to climb. Quite a bit of elevation is gained in the first mile and a half, using switchbacks that zig zag through a less-than-inspiring second-growth forest. The best part about this section is the shade, and occasional peek-a-boo views of Rainier.",
    "url": "http://www.wta.org/go-hiking/hikes/crystal-peaks"
  },

  {
    "name": "Sheep Lake and Sourdough Gap",
    "location": "Mount Rainer Area",
    "rating": "3.6",
    "distance": "7.0",
    "elevation": "1100",
    "description": "This is a pleasant hike to a small lake and a notched gap with sweeping views. Sheep Lake is nestled in a subalpine area that explodes with wildflowers in July and August. The lake is a good place to relax and enjoy nature or perhaps take off your boots and go wading. Sourdough Gap is a small saddle in a rocky-edged ridge. The hike from the lake to the gap offers increasingly picturesque views of the south Cascades with every foot of altitude you gain. Once at the gap, you will be rewarded with grand views of Sheep Lake on one side and the Chrystal Lakes basin on the other side.",
    "url": "http://www.wta.org/go-hiking/hikes/sourdough-gap"
  },

  {
    "name": "Owyhigh Lakes",
    "location": "Mount Rainer Area",
    "rating": "3.0",
    "distance": "8.0",
    "elevation": "1650",
    "description": "The local wildlife love the Owyhigh Lakes. This pair of shallow forest lakes provides good water, lots of forage in the shoreline meadows, and wonderful cover in the forests that press in around the lakes. Hikers find limited views from the trail--though there are nice views up to Cowlitz Chimneys and Tamanos Mountain. But the forest environment this trail explores is unmatched for those who appreciate a rich woodland ecosystem. Kids and adults appreciate the wildlife-viewing potential. Birds and beasts (large and small) thrive in this forest, and birds fill the lakes basin. Repeated visits to the lakes have let me spot grouse, pileated woodpeckers, mountain blue jays, cedar waxwings, ospreys, bald eagles, golden eagles, tanagers, and a host of birds I couldn't identify. There's also a fair amount of huckleberries along the route if you time your trip just right. Running south through lush old forest, the trail climbs steadily from the get-go. ",
    "url": "http://www.wta.org/go-hiking/hikes/owyhigh-lakes"
  },

  {
    "name": "Sun Top Snowshoe",
    "location": "Mount Rainer Area",
    "rating": "2.5",
    "distance": "10.0",
    "elevation": "3000",
    "description": "The route to the top of Sun Top is often groomed for cross-country skiers, but snowshoers will still enjoy this trek. After all, the views are just as spectacular, and the winter landscape just as pretty, even when the trail has been leveled for skiers. Just stick to the edges of the road to avoid tromping on skiers' tracks, and take advantage of any opportunity to climb off the road and cross open meadows for maximum snowshoeing fun. Attaining the summit of Sun Top requires considerable energy, but the workout is well rewarded with unmatched views of the country northwest of Mount Rainier. The White River valley stretches below the mountain, and Mount Rainier towers above. The lower section of the route is sometimes visited by the White River elk herd, so keep an eye out for the big beasts. This is also prime cougar country (due, in large part, to the presence of the elk). Seeing one of the big cats is a pleasure. Cougars pose little threat to adult humans, although kids shouldn't be allowed to run ahead. The odds of seeing a mountain lion are extremely low, but a couple lucky snowshoers have excitedly reported seeing the tawny cats streaking away from the road when the elk are nearby. ",
    "url": "http://www.wta.org/go-hiking/hikes/sun-top-snowshoe"
  },

  {
    "name": "Dalles Ridge",
    "location": "Mount Rainer Area",
    "rating": "3.8",
    "distance": "1.8",
    "elevation": "200",
    "description": "Dalles Ridge is the primary way that hikers access the popular Noble Knob Trail and Ranger Creek. It provides hikers with a beautiful ridge walk after a steady climb from the trailhead. Begin in a clearing at about 5,300 feet and follow the trail up the ridgeline. A little more than half a mile up the trail, arrive at a junction with the Ranger Creek Trail. From here you can often glimpse Mounts Rainier and Baker, Glacier Peak, and the craggy Stuart Range. If it's particularly clear, you may even catch sight of the Olympics.  ",
    "url": "http://www.wta.org/go-hiking/hikes/dalles-ridge"
  },

  {
    "name": "Little Ranger Peak",
    "location": "Mount Rainer Area",
    "rating": "3.2",
    "distance": "12.0",
    "elevation": "2500",
    "description": "This infrequently visited trail is the perfect hike early in the season, because the snow melts off the south-facing flanks of the peak early. If you miss the springtime, save it for fall, because the deciduous trees that line the path make it ideal for a shot of fall color. Enjoy a moderately graded that leads you to a summit that boasts views of Rainier and the White River valley. Follow the White River Trail south along the highway to find the trailhead for the Ranger Creek Trail. Start here, and climb gradually through imposing old-growth forest, passing trees laden with moss. The abundance of life surrounding you is humbling. ",
    "url": "http://www.wta.org/go-hiking/hikes/little-ranger-peak"
  },

  {
    "name": "Arch Rock",
    "location": "Mount Rainer Area",
    "rating": "4.6",
    "distance": "12.0",
    "elevation": "500",
    "description": "Following the Pacific Crest Trail (PCT) south from the broad fields of Government Meadow, this route explores one of the most solitary sections of the nation's premiere trail. Hikers can experience deep forests and rock bluffs, and dogs can walk with their humans without worrying about encountering too many other hikers along the way. The trail starts on an old wagon road that crossed the Cascades at nearby Naches Pass (now used extensively by four-wheel-drive fanatics).The trail leaves the clear-cut on an old logging road that leads into the trees. In 0.5 mile the broad connector trail ends at a junction with the PCT. Turning left leads you to Government Meadow in about 0.5 mile. Take this side trip now, or leave it for your return trip.",
    "url": "http://www.wta.org/go-hiking/hikes/arch-rock"
  }
]
